docs/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-13 Mon 09:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="b-coimbra" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Git</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcdcb863">1. General</a></li>
<li><a href="#org26fcbef">2. Remove unwanted commited files</a></li>
<li><a href="#orgc8880c5">3. Hooks</a></li>
<li><a href="#org6dc908e">4. Bisect</a></li>
<li><a href="#orgf8da119">5. Commit messages</a>
<ul>
<li><a href="#orgc3a054a">5.1. Structural elements</a></li>
<li><a href="#org3e585a7">5.2. Type with scope</a></li>
<li><a href="#orgf3251f0">5.3. <code>!</code> to draw attention</a></li>
</ul>
</li>
<li><a href="#org2ba4cd7">6. Working with a team</a>
<ul>
<li><a href="#orgdf92202">6.1. Stashing</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcdcb863" class="outline-2">
<h2 id="orgcdcb863"><span class="section-number-2">1</span> General</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>git rebase -i HEAD~n</code></td>
<td class="org-left">where <b>n</b> is the number of commits</td>
</tr>

<tr>
<td class="org-left"><code>git commit --amend</code></td>
<td class="org-left">modifies the most recent commit</td>
</tr>

<tr>
<td class="org-left"><code>git push origin &lt;branch&gt; -f</code></td>
<td class="org-left"><code>-f</code> forced push</td>
</tr>

<tr>
<td class="org-left"><code>git rebase --continue</code></td>
<td class="org-left">after resolving rebase conflicts</td>
</tr>

<tr>
<td class="org-left"><code>git rebase -i</code></td>
<td class="org-left">interactive rebase for rewriting history</td>
</tr>

<tr>
<td class="org-left"><code>git reset origin/develop -- &lt;file&gt;</code></td>
<td class="org-left">subtitute a local file with develop's</td>
</tr>

<tr>
<td class="org-left"><code>git add -i</code></td>
<td class="org-left">interactive git add</td>
</tr>

<tr>
<td class="org-left"><code>git add -p</code></td>
<td class="org-left">stage specified chunks</td>
</tr>

<tr>
<td class="org-left"><code>git gc</code></td>
<td class="org-left">manually clean git's mess</td>
</tr>

<tr>
<td class="org-left"><code>git branch -m &lt;oldname&gt; &lt;newname&gt;</code></td>
<td class="org-left">rename branch</td>
</tr>

<tr>
<td class="org-left"><code>git diff</code></td>
<td class="org-left">view uncommited changes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org26fcbef" class="outline-2">
<h2 id="org26fcbef"><span class="section-number-2">2</span> Remove unwanted commited files</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><code>git reset origin/develop -- &lt;file&gt;</code></li>
<li><code>git commit --amend</code></li>
</ol>
</div>
</div>

<div id="outline-container-orgc8880c5" class="outline-2">
<h2 id="orgc8880c5"><span class="section-number-2">3</span> Hooks</h2>
<div class="outline-text-2" id="text-3">
<p>
Git hooks are stored inside <code>.git/hooks</code> and have a <code>sample</code> extension on them.
By removing that extension, the hook will be executed depending on the action performed (eg. commit/push)
</p>

<p>
Hooks are essentially shell scripts &#x2013; they can either be written in bash, python or ruby.
</p>
</div>
</div>

<div id="outline-container-org6dc908e" class="outline-2">
<h2 id="org6dc908e"><span class="section-number-2">4</span> Bisect</h2>
<div class="outline-text-2" id="text-4">
<p>
Useful for finding a specific faulty commit that introduced a bug somewhere in a project.
</p>

<div class="org-src-container">
<pre class="src src-bash">$ git bisect start
$ git bisect bad   <span style="color: #686858;"># </span><span style="color: #686858;">current version (commit) is bad</span>
$ git bisect good  <span style="color: #686858;"># </span><span style="color: #686858;">current version (commit) is good</span>
$ git bisect reset <span style="color: #686858;"># </span><span style="color: #686858;">return to commit after bisect star</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8da119" class="outline-2">
<h2 id="orgf8da119"><span class="section-number-2">5</span> Commit messages</h2>
<div class="outline-text-2" id="text-5">
<p>
Reference: <a href="https://www.conventionalcommits.org/en/v1.0.0/">conventional commits</a>.
</p>

<blockquote>
<p>
&lt;type&gt;[optional scope]: &lt;description&gt;
</p>

<p>
[optional body]
</p>

<p>
[optional footer(s)]
</p>
</blockquote>
</div>

<div id="outline-container-orgc3a054a" class="outline-3">
<h3 id="orgc3a054a"><span class="section-number-3">5.1</span> Structural elements</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Structural elements, to better communicate intent:
</p>

<ul class="org-ul">
<li><b>fix</b>: patches a bug in your codebase</li>
<li><b>feat</b>: introduces a new feature to the codebase</li>
</ul>

<p>
Other types are also allowed, such as <b>build: *chore:</b> <b>docs: *ci:</b> <b>refactor:</b> <b>test:</b>
</p>
</div>
</div>

<div id="outline-container-org3e585a7" class="outline-3">
<h3 id="org3e585a7"><span class="section-number-3">5.2</span> Type with scope</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Commit message with scope:
</p>

<blockquote>
<p>
feat(lang): add polish language
docs(roadmap): move roadmap out of readme
chore(ci): remove ci for 4.x and 5.x
docs(CHANGELOG): update metadata
chore(.gitignore): ignores more files/folders
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgf3251f0" class="outline-3">
<h3 id="orgf3251f0"><span class="section-number-3">5.3</span> <code>!</code> to draw attention</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Commit message with ! to draw attention to breaking change:
</p>

<blockquote>
<p>
refactor!: drop support for Node 6
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org2ba4cd7" class="outline-2">
<h2 id="org2ba4cd7"><span class="section-number-2">6</span> Working with a team</h2>
<div class="outline-text-2" id="text-6">
<p>
Create a master branch for the feature:
</p>

<ol class="org-ol">
<li>Starting at the <code>develop/</code> branch, create a new branch: <code>$ git checkout -b users/bruno.coimbra/UpdateRDESP</code></li>
</ol>
</div>

<div id="outline-container-orgdf92202" class="outline-3">
<h3 id="orgdf92202"><span class="section-number-3">6.1</span> <a href="https://git-scm.com/book/pt-br/v2/Git-Tools-Stashing-and-Cleaning">Stashing</a></h3>
<div class="outline-text-3" id="text-6-1">
<p>
Often, we might want to switch to a different branch and save our changes before doing so. But the issue is, if we have unfinished
work on our branch, we don't want to create another commit just to save our dirty, half-done work. <code>git stash</code> comes to the rescue
to solve this particular problem:
</p>

<p>
To push a new stash onto your stack, run <code>git stash</code> or <code>git stash save</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git stash
Saved working directory and index state <span style="color: #87875f;">\</span>
      <span style="color: #87875f;">"WIP on master: 049d078 added the index file"</span>
HEAD is now at 049d078 added the index file
(To restore them type <span style="color: #87875f;">"git stash apply"</span>)
</pre>
</div>

<p>
At this point, you can easily switch branches and do work elsewhere; your changes are stored on your stack.
To see which stashes you’ve stored, you can use <code>git stash list</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git stash list
stash@{0}: WIP on master: 049d078 added the index file
stash@{1}: WIP on master: c264051 Revert <span style="color: #87875f;">"added file_size"</span>
stash@{2}: WIP on master: 21d80a5 added number to log
</pre>
</div>

<p>
In this case, two stashes were done previously, so you have access to three different stashed works.
You can reapply the one you just stashed by using the command shown in the help output of the original stash command: <code>git stash apply</code>.
If you want to apply one of the older stashes, you can specify it by naming it, like this: <code>git stash apply stash@{2}</code>.
If you don’t specify a stash, Git assumes the most recent stash and tries to apply it:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git stash apply
On branch master
Changes not staged for commit:
(use <span style="color: #87875f;">"git add &lt;file&gt;..."</span> to update what will be committed)
(use <span style="color: #87875f;">"git checkout -- &lt;file&gt;..."</span> to discard changes<span style="color: #87AFD7; font-weight: bold;"> in</span> working directory)

modified:   index.html
modified:   lib/simplegit.rb

no changes added to commit (use <span style="color: #87875f;">"git add"</span> and/or <span style="color: #87875f;">"git commit -a"</span>)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-09-11 Sat 00:00</p>
<p class="author">Author: b-coimbra</p>
<p class="date">Created: 2021-09-13 Mon 09:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
